Revit 2018 API
MessageBoxShowingEventArgs Properties
The MessageBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
DialogId |  (Inherited from DialogBoxShowingEventArgs.)
DialogType
 An integer that describes the standard Windows type of the dialog box.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Message
 The message that has been displayed in the dialog box.
See Also
MessageBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace